Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17154.h
extern volatile PIR2bits_t PIR2bits __at(0x08E);
// bitfield macros
#define _PIR2_TMR3IF_POSN                                   0x0
#define _PIR2_TMR3IF_POSITION                               0x0
#define _PIR2_TMR3IF_SIZE                                   0x1
#define _PIR2_TMR3IF_LENGTH                                 0x1
#define _PIR2_TMR3IF_MASK                                   0x1
#define _PIR2_TMR3GIF_POSN                                  0x1
#define _PIR2_TMR3GIF_POSITION                              0x1
#define _PIR2_TMR3GIF_SIZE                                  0x1
#define _PIR2_TMR3GIF_LENGTH                                0x1
#define _PIR2_TMR3GIF_MASK                                  0x2
#define _PIR2_TMR2IF_POSN                                   0x2
#define _PIR2_TMR2IF_POSITION                               0x2
#define _PIR2_TMR2IF_SIZE                                   0x1
#define _PIR2_TMR2IF_LENGTH                                 0x1
#define _PIR2_TMR2IF_MASK                                   0x4
#define _PIR2_TMR4IF_POSN                                   0x3
#define _PIR2_TMR4IF_POSITION                               0x3
#define _PIR2_TMR4IF_SIZE                                   0x1
#define _PIR2_TMR4IF_LENGTH                                 0x1
#define _PIR2_TMR4IF_MASK                                   0x8
#define _PIR2_TMR6IF_POSN                                   0x4
#define _PIR2_TMR6IF_POSITION                               0x4
#define _PIR2_TMR6IF_SIZE                                   0x1
#define _PIR2_TMR6IF_LENGTH                                 0x1
#define _PIR2_TMR6IF_MASK                                   0x10
#define _PIR2_CCP1IF_POSN                                   0x5
#define _PIR2_CCP1IF_POSITION                               0x5
#define _PIR2_CCP1IF_SIZE                                   0x1
#define _PIR2_CCP1IF_LENGTH                                 0x1
#define _PIR2_CCP1IF_MASK                                   0x20
#define _PIR2_CCP2IF_POSN                                   0x6
#define _PIR2_CCP2IF_POSITION                               0x6
#define _PIR2_CCP2IF_SIZE                                   0x1
#define _PIR2_CCP2IF_LENGTH                                 0x1
#define _PIR2_CCP2IF_MASK                                   0x40

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x08F);
#ifndef _LIB_BUILD
asm("PIR3 equ 08Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PWM1PIF                :1;
        unsigned PWM1IF                 :1;
        unsigned PWM2PIF                :1;
        unsigned PWM2IF                 :1;
        unsigned PWM3PIF                :1;
        unsigned PWM3IF                 :1;
        unsigned PWM4PIF                :1;
        unsigned PWM4IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x08F);
// bitfield macros
#define _PIR3_PWM1PIF_POSN                                  0x0
#define _PIR3_PWM1PIF_POSITION                              0x0
#define _PIR3_PWM1PIF_SIZE                                  0x1
#define _PIR3_PWM1PIF_LENGTH                                0x1
#define _PIR3_PWM1PIF_MASK                                  0x1
#define _PIR3_PWM1IF_POSN                                   0x1
#define _PIR3_PWM1IF_POSITION                               0x1
#define _PIR3_PWM1IF_SIZE                                   0x1
#define _PIR3_PWM1IF_LENGTH                                 0x1
#define _PIR3_PWM1IF_MASK                                   0x2
#define _PIR3_PWM2PIF_POSN                                  0x2
#define _PIR3_PWM2PIF_POSITION                              0x2
#define _PIR3_PWM2PIF_SIZE                                  0x1
#define _PIR3_PWM2PIF_LENGTH                                0x1
#define _PIR3_PWM2PIF_MASK                                  0x4
#define _PIR3_PWM2IF_POSN                                   0x3
#define _PIR3_PWM2IF_POSITION                               0x3
#define _PIR3_PWM2IF_SIZE                                   0x1
#define _PIR3_PWM2IF_LENGTH                                 0x1
#define _PIR3_PWM2IF_MASK                                   0x8
#define _PIR3_PWM3PIF_POSN                                  0x4
#define _PIR3_PWM3PIF_POSITION                              0x4
#define _PIR3_PWM3PIF_SIZE                                  0x1
#define _PIR3_PWM3PIF_LENGTH                                0x1
#define _PIR3_PWM3PIF_MASK                                  0x10
#define _PIR3_PWM3IF_POSN                                   0x5
#define _PIR3_PWM3IF_POSITION                               0x5
#define _PIR3_PWM3IF_SIZE                                   0x1
#define _PIR3_PWM3IF_LENGTH                                 0x1
#define _PIR3_PWM3IF_MASK                                   0x20
#define _PIR3_PWM4PIF_POSN                                  0x6
#define _PIR3_PWM4PIF_POSITION                              0x6
#define _PIR3_PWM4PIF_SIZE                                  0x1
#define _PIR3_PWM4PIF_LENGTH                                0x1
#define _PIR3_PWM4PIF_MASK                                  0x40
#define _PIR3_PWM4IF_POSN                                   0x7
#define _PIR3_PWM4IF_POSITION                               0x7
#define _PIR3_PWM4IF_SIZE                                   0x1
#define _PIR3_PWM4IF_LENGTH                                 0x1
#define _PIR3_PWM4IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x090);
#ifndef _LIB_BUILD
asm("PIR4 equ 090h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCO1IF                 :1;
        unsigned CWG1IF                 :1;
        unsigned CLC1IF                 :1;
        unsigned CLC2IF                 :1;
        unsigned CLC3IF                 :1;
        unsigned CLC4IF                 :1;
        unsigned TX1IF                  :1;
        unsigned RC1IF                  :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x090);
// bitfield macros
#define _PIR4_NCO1IF_POSN                                   0x0
#define _PIR4_NCO1IF_POSITION                               0x0
#define _PIR4_NCO1IF_SIZE                                   0x1
#define _PIR4_NCO1IF_LENGTH                                 0x1
#define _PIR4_NCO1IF_MASK                                   0x1
#define _PIR4_CWG1IF_POSN                                   0x1
#define _PIR4_CWG1IF_POSITION                               0x1
#define _PIR4_CWG1IF_SIZE                                   0x1
#define _PIR4_CWG1IF_LENGTH                                 0x1
#define _PIR4_CWG1IF_MASK                                   0x2
#define _PIR4_CLC1IF_POSN                                   0x2
#define _PIR4_CLC1IF_POSITION                               0x2
#define _PIR4_CLC1IF_SIZE                                   0x1
#define _PIR4_CLC1IF_LENGTH                                 0x1
#define _PIR4_CLC1IF_MASK                                   0x4
#define _PIR4_CLC2IF_POSN                                   0x3
#define _PIR4_CLC2IF_POSITION                               0x3
#define _PIR4_CLC2IF_SIZE                                   0x1
#define _PIR4_CLC2IF_LENGTH                                 0x1
#define _PIR4_CLC2IF_MASK                                   0x8
#define _PIR4_CLC3IF_POSN                                   0x4
#define _PIR4_CLC3IF_POSITION                               0x4
#define _PIR4_CLC3IF_SIZE                                   0x1
#define _PIR4_CLC3IF_LENGTH                                 0x1
#define _PIR4_CLC3IF_MASK                                   0x10
#define _PIR4_CLC4IF_POSN                                   0x5
#define _PIR4_CLC4IF_POSITION                               0x5
#define _PIR4_CLC4IF_SIZE                                   0x1
#define _PIR4_CLC4IF_LENGTH                                 0x1
#define _PIR4_CLC4IF_MASK                                   0x20
#define _PIR4_TX1IF_POSN                                    0x6
#define _PIR4_TX1IF_POSITION                                0x6
#define _PIR4_TX1IF_SIZE                                    0x1
#define _PIR4_TX1IF_LENGTH                                  0x1
#define _PIR4_TX1IF_MASK                                    0x40
#define _PIR4_RC1IF_POSN                                    0x7
#define _PIR4_RC1IF_POSITION                                0x7
#define _PIR4_RC1IF_SIZE                                    0x1
#define _PIR4_RC1IF_LENGTH                                  0x1
#define _PIR4_RC1IF_MASK                                    0x80

