Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17154.h
extern volatile T3GATEbits_t T3GATEbits __at(0x316);
// bitfield macros
#define _T3GATE_GSS_POSN                                    0x0
#define _T3GATE_GSS_POSITION                                0x0
#define _T3GATE_GSS_SIZE                                    0x5
#define _T3GATE_GSS_LENGTH                                  0x5
#define _T3GATE_GSS_MASK                                    0x1F
#define _T3GATE_GSS0_POSN                                   0x0
#define _T3GATE_GSS0_POSITION                               0x0
#define _T3GATE_GSS0_SIZE                                   0x1
#define _T3GATE_GSS0_LENGTH                                 0x1
#define _T3GATE_GSS0_MASK                                   0x1
#define _T3GATE_GSS1_POSN                                   0x1
#define _T3GATE_GSS1_POSITION                               0x1
#define _T3GATE_GSS1_SIZE                                   0x1
#define _T3GATE_GSS1_LENGTH                                 0x1
#define _T3GATE_GSS1_MASK                                   0x2
#define _T3GATE_GSS2_POSN                                   0x2
#define _T3GATE_GSS2_POSITION                               0x2
#define _T3GATE_GSS2_SIZE                                   0x1
#define _T3GATE_GSS2_LENGTH                                 0x1
#define _T3GATE_GSS2_MASK                                   0x4
#define _T3GATE_GSS3_POSN                                   0x3
#define _T3GATE_GSS3_POSITION                               0x3
#define _T3GATE_GSS3_SIZE                                   0x1
#define _T3GATE_GSS3_LENGTH                                 0x1
#define _T3GATE_GSS3_MASK                                   0x8
#define _T3GATE_GSS4_POSN                                   0x4
#define _T3GATE_GSS4_POSITION                               0x4
#define _T3GATE_GSS4_SIZE                                   0x1
#define _T3GATE_GSS4_LENGTH                                 0x1
#define _T3GATE_GSS4_MASK                                   0x10
#define _T3GATE_T3GSS0_POSN                                 0x0
#define _T3GATE_T3GSS0_POSITION                             0x0
#define _T3GATE_T3GSS0_SIZE                                 0x1
#define _T3GATE_T3GSS0_LENGTH                               0x1
#define _T3GATE_T3GSS0_MASK                                 0x1
#define _T3GATE_T3GSS1_POSN                                 0x1
#define _T3GATE_T3GSS1_POSITION                             0x1
#define _T3GATE_T3GSS1_SIZE                                 0x1
#define _T3GATE_T3GSS1_LENGTH                               0x1
#define _T3GATE_T3GSS1_MASK                                 0x2
#define _T3GATE_T3GSS2_POSN                                 0x2
#define _T3GATE_T3GSS2_POSITION                             0x2
#define _T3GATE_T3GSS2_SIZE                                 0x1
#define _T3GATE_T3GSS2_LENGTH                               0x1
#define _T3GATE_T3GSS2_MASK                                 0x4
#define _T3GATE_T3GSS3_POSN                                 0x3
#define _T3GATE_T3GSS3_POSITION                             0x3
#define _T3GATE_T3GSS3_SIZE                                 0x1
#define _T3GATE_T3GSS3_LENGTH                               0x1
#define _T3GATE_T3GSS3_MASK                                 0x8
#define _T3GATE_T3GSS4_POSN                                 0x4
#define _T3GATE_T3GSS4_POSITION                             0x4
#define _T3GATE_T3GSS4_SIZE                                 0x1
#define _T3GATE_T3GSS4_LENGTH                               0x1
#define _T3GATE_T3GSS4_MASK                                 0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned GSS                    :5;
    };
    struct {
        unsigned GSS0                   :1;
        unsigned GSS1                   :1;
        unsigned GSS2                   :1;
        unsigned GSS3                   :1;
        unsigned GSS4                   :1;
    };
    struct {
        unsigned T3GSS0                 :1;
        unsigned T3GSS1                 :1;
        unsigned T3GSS2                 :1;
        unsigned T3GSS3                 :1;
        unsigned T3GSS4                 :1;
    };
} TMR3GATEbits_t;
extern volatile TMR3GATEbits_t TMR3GATEbits __at(0x316);
// bitfield macros
#define _TMR3GATE_GSS_POSN                                  0x0
#define _TMR3GATE_GSS_POSITION                              0x0
#define _TMR3GATE_GSS_SIZE                                  0x5
#define _TMR3GATE_GSS_LENGTH                                0x5
#define _TMR3GATE_GSS_MASK                                  0x1F
#define _TMR3GATE_GSS0_POSN                                 0x0
#define _TMR3GATE_GSS0_POSITION                             0x0
#define _TMR3GATE_GSS0_SIZE                                 0x1
#define _TMR3GATE_GSS0_LENGTH                               0x1
#define _TMR3GATE_GSS0_MASK                                 0x1
#define _TMR3GATE_GSS1_POSN                                 0x1
#define _TMR3GATE_GSS1_POSITION                             0x1
#define _TMR3GATE_GSS1_SIZE                                 0x1
#define _TMR3GATE_GSS1_LENGTH                               0x1
#define _TMR3GATE_GSS1_MASK                                 0x2
#define _TMR3GATE_GSS2_POSN                                 0x2
#define _TMR3GATE_GSS2_POSITION                             0x2
#define _TMR3GATE_GSS2_SIZE                                 0x1
#define _TMR3GATE_GSS2_LENGTH                               0x1
#define _TMR3GATE_GSS2_MASK                                 0x4
#define _TMR3GATE_GSS3_POSN                                 0x3
#define _TMR3GATE_GSS3_POSITION                             0x3
#define _TMR3GATE_GSS3_SIZE                                 0x1
#define _TMR3GATE_GSS3_LENGTH                               0x1
#define _TMR3GATE_GSS3_MASK                                 0x8
#define _TMR3GATE_GSS4_POSN                                 0x4
#define _TMR3GATE_GSS4_POSITION                             0x4
#define _TMR3GATE_GSS4_SIZE                                 0x1
#define _TMR3GATE_GSS4_LENGTH                               0x1
#define _TMR3GATE_GSS4_MASK                                 0x10
#define _TMR3GATE_T3GSS0_POSN                               0x0
#define _TMR3GATE_T3GSS0_POSITION                           0x0
#define _TMR3GATE_T3GSS0_SIZE                               0x1
#define _TMR3GATE_T3GSS0_LENGTH                             0x1
#define _TMR3GATE_T3GSS0_MASK                               0x1
#define _TMR3GATE_T3GSS1_POSN                               0x1
#define _TMR3GATE_T3GSS1_POSITION                           0x1
#define _TMR3GATE_T3GSS1_SIZE                               0x1
#define _TMR3GATE_T3GSS1_LENGTH                             0x1
#define _TMR3GATE_T3GSS1_MASK                               0x2
#define _TMR3GATE_T3GSS2_POSN                               0x2
#define _TMR3GATE_T3GSS2_POSITION                           0x2
#define _TMR3GATE_T3GSS2_SIZE                               0x1
#define _TMR3GATE_T3GSS2_LENGTH                             0x1
#define _TMR3GATE_T3GSS2_MASK                               0x4
#define _TMR3GATE_T3GSS3_POSN                               0x3
#define _TMR3GATE_T3GSS3_POSITION                           0x3
#define _TMR3GATE_T3GSS3_SIZE                               0x1
#define _TMR3GATE_T3GSS3_LENGTH                             0x1
#define _TMR3GATE_T3GSS3_MASK                               0x8
#define _TMR3GATE_T3GSS4_POSN                               0x4
#define _TMR3GATE_T3GSS4_POSITION                           0x4
#define _TMR3GATE_T3GSS4_SIZE                               0x1
#define _TMR3GATE_T3GSS4_LENGTH                             0x1
#define _TMR3GATE_T3GSS4_MASK                               0x10

// Register: T3CLK
#define T3CLK T3CLK
extern volatile unsigned char           T3CLK               __at(0x317);
#ifndef _LIB_BUILD
asm("T3CLK equ 0317h");
#endif
// aliases
extern volatile unsigned char           TMR3CLK             __at(0x317);
#ifndef _LIB_BUILD
asm("TMR3CLK equ 0317h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
        unsigned T3CS2                  :1;
        unsigned T3CS3                  :1;
        unsigned T3CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} T3CLKbits_t;
extern volatile T3CLKbits_t T3CLKbits __at(0x317);
// bitfield macros
#define _T3CLK_CS_POSN                                      0x0
#define _T3CLK_CS_POSITION                                  0x0
#define _T3CLK_CS_SIZE                                      0x8
#define _T3CLK_CS_LENGTH                                    0x8
#define _T3CLK_CS_MASK                                      0xFF
#define _T3CLK_T3CS0_POSN                                   0x0
#define _T3CLK_T3CS0_POSITION                               0x0
#define _T3CLK_T3CS0_SIZE                                   0x1
#define _T3CLK_T3CS0_LENGTH                                 0x1
#define _T3CLK_T3CS0_MASK                                   0x1
#define _T3CLK_T3CS1_POSN                                   0x1
#define _T3CLK_T3CS1_POSITION                               0x1
#define _T3CLK_T3CS1_SIZE                                   0x1
#define _T3CLK_T3CS1_LENGTH                                 0x1
#define _T3CLK_T3CS1_MASK                                   0x2
#define _T3CLK_T3CS2_POSN                                   0x2
#define _T3CLK_T3CS2_POSITION                               0x2
#define _T3CLK_T3CS2_SIZE                                   0x1
#define _T3CLK_T3CS2_LENGTH                                 0x1
#define _T3CLK_T3CS2_MASK                                   0x4
#define _T3CLK_T3CS3_POSN                                   0x3
#define _T3CLK_T3CS3_POSITION                               0x3
#define _T3CLK_T3CS3_SIZE                                   0x1
#define _T3CLK_T3CS3_LENGTH                                 0x1
#define _T3CLK_T3CS3_MASK                                   0x8
#define _T3CLK_T3CS4_POSN                                   0x4
#define _T3CLK_T3CS4_POSITION                               0x4
#define _T3CLK_T3CS4_SIZE                                   0x1
#define _T3CLK_T3CS4_LENGTH                                 0x1
#define _T3CLK_T3CS4_MASK                                   0x10
#define _T3CLK_CS0_POSN                                     0x0
#define _T3CLK_CS0_POSITION                                 0x0
#define _T3CLK_CS0_SIZE                                     0x1
#define _T3CLK_CS0_LENGTH                                   0x1
#define _T3CLK_CS0_MASK                                     0x1
#define _T3CLK_CS1_POSN                                     0x1
#define _T3CLK_CS1_POSITION                                 0x1
#define _T3CLK_CS1_SIZE                                     0x1
#define _T3CLK_CS1_LENGTH                                   0x1
#define _T3CLK_CS1_MASK                                     0x2
#define _T3CLK_CS2_POSN                                     0x2
#define _T3CLK_CS2_POSITION                                 0x2
#define _T3CLK_CS2_SIZE                                     0x1
#define _T3CLK_CS2_LENGTH                                   0x1
#define _T3CLK_CS2_MASK                                     0x4
#define _T3CLK_CS3_POSN                                     0x3
#define _T3CLK_CS3_POSITION                                 0x3
#define _T3CLK_CS3_SIZE                                     0x1
#define _T3CLK_CS3_LENGTH                                   0x1
#define _T3CLK_CS3_MASK                                     0x8
#define _T3CLK_CS4_POSN                                     0x4
#define _T3CLK_CS4_POSITION                                 0x4
#define _T3CLK_CS4_SIZE                                     0x1
#define _T3CLK_CS4_LENGTH                                   0x1
#define _T3CLK_CS4_MASK                                     0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned CS                     :8;
    };
    struct {
        unsigned T3CS0                  :1;
        unsigned T3CS1                  :1;
        unsigned T3CS2                  :1;
        unsigned T3CS3                  :1;
        unsigned T3CS4                  :1;
    };
    struct {
        unsigned CS0                    :1;
        unsigned CS1                    :1;
        unsigned CS2                    :1;
        unsigned CS3                    :1;
        unsigned CS4                    :1;
    };
} TMR3CLKbits_t;
extern volatile TMR3CLKbits_t TMR3CLKbits __at(0x317);
// bitfield macros
#define _TMR3CLK_CS_POSN                                    0x0
#define _TMR3CLK_CS_POSITION                                0x0
#define _TMR3CLK_CS_SIZE                                    0x8
#define _TMR3CLK_CS_LENGTH                                  0x8
#define _TMR3CLK_CS_MASK                                    0xFF
#define _TMR3CLK_T3CS0_POSN                                 0x0
#define _TMR3CLK_T3CS0_POSITION                             0x0
#define _TMR3CLK_T3CS0_SIZE                                 0x1
#define _TMR3CLK_T3CS0_LENGTH                               0x1
#define _TMR3CLK_T3CS0_MASK                                 0x1
#define _TMR3CLK_T3CS1_POSN                                 0x1
#define _TMR3CLK_T3CS1_POSITION                             0x1
#define _TMR3CLK_T3CS1_SIZE                                 0x1
#define _TMR3CLK_T3CS1_LENGTH                               0x1
#define _TMR3CLK_T3CS1_MASK                                 0x2
#define _TMR3CLK_T3CS2_POSN                                 0x2
#define _TMR3CLK_T3CS2_POSITION                             0x2
#define _TMR3CLK_T3CS2_SIZE                                 0x1
#define _TMR3CLK_T3CS2_LENGTH                               0x1
#define _TMR3CLK_T3CS2_MASK                                 0x4
#define _TMR3CLK_T3CS3_POSN                                 0x3
#define _TMR3CLK_T3CS3_POSITION                             0x3
#define _TMR3CLK_T3CS3_SIZE                                 0x1
#define _TMR3CLK_T3CS3_LENGTH                               0x1
#define _TMR3CLK_T3CS3_MASK                                 0x8
#define _TMR3CLK_T3CS4_POSN                                 0x4
#define _TMR3CLK_T3CS4_POSITION                             0x4
#define _TMR3CLK_T3CS4_SIZE                                 0x1
#define _TMR3CLK_T3CS4_LENGTH                               0x1
#define _TMR3CLK_T3CS4_MASK                                 0x10
#define _TMR3CLK_CS0_POSN                                   0x0
#define _TMR3CLK_CS0_POSITION                               0x0
#define _TMR3CLK_CS0_SIZE                                   0x1
#define _TMR3CLK_CS0_LENGTH                                 0x1
#define _TMR3CLK_CS0_MASK                                   0x1
#define _TMR3CLK_CS1_POSN                                   0x1
#define _TMR3CLK_CS1_POSITION                               0x1
#define _TMR3CLK_CS1_SIZE                                   0x1
#define _TMR3CLK_CS1_LENGTH                                 0x1
#define _TMR3CLK_CS1_MASK                                   0x2
#define _TMR3CLK_CS2_POSN                                   0x2
#define _TMR3CLK_CS2_POSITION                               0x2
#define _TMR3CLK_CS2_SIZE                                   0x1
#define _TMR3CLK_CS2_LENGTH                                 0x1
#define _TMR3CLK_CS2_MASK                                   0x4
#define _TMR3CLK_CS3_POSN                                   0x3
#define _TMR3CLK_CS3_POSITION                               0x3
#define _TMR3CLK_CS3_SIZE                                   0x1
#define _TMR3CLK_CS3_LENGTH                                 0x1
#define _TMR3CLK_CS3_MASK                                   0x8
#define _TMR3CLK_CS4_POSN                                   0x4
#define _TMR3CLK_CS4_POSITION                               0x4
#define _TMR3CLK_CS4_SIZE                                   0x1
#define _TMR3CLK_CS4_LENGTH                                 0x1
#define _TMR3CLK_CS4_MASK                                   0x10

// Register: T2TMR
#define T2TMR T2TMR
extern volatile unsigned char           T2TMR               __at(0x38C);
#ifndef _LIB_BUILD
asm("T2TMR equ 038Ch");
#endif
// aliases
extern volatile unsigned char           TMR2                __at(0x38C);
#ifndef _LIB_BUILD
asm("TMR2 equ 038Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2TMR                  :8;
    };
    struct {
        unsigned TMR2                   :8;
    };
} T2TMRbits_t;
extern volatile T2TMRbits_t T2TMRbits __at(0x38C);
// bitfield macros
#define _T2TMR_T2TMR_POSN                                   0x0
#define _T2TMR_T2TMR_POSITION                               0x0
#define _T2TMR_T2TMR_SIZE                                   0x8
#define _T2TMR_T2TMR_LENGTH                                 0x8
#define _T2TMR_T2TMR_MASK                                   0xFF
#define _T2TMR_TMR2_POSN                                    0x0
#define _T2TMR_TMR2_POSITION                                0x0
#define _T2TMR_TMR2_SIZE                                    0x8
#define _T2TMR_TMR2_LENGTH                                  0x8
#define _T2TMR_TMR2_MASK                                    0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2TMR                  :8;
    };
    struct {
        unsigned TMR2                   :8;
    };
} TMR2bits_t;
extern volatile TMR2bits_t TMR2bits __at(0x38C);
// bitfield macros
#define _TMR2_T2TMR_POSN                                    0x0
#define _TMR2_T2TMR_POSITION                                0x0
#define _TMR2_T2TMR_SIZE                                    0x8
#define _TMR2_T2TMR_LENGTH                                  0x8
#define _TMR2_T2TMR_MASK                                    0xFF
#define _TMR2_TMR2_POSN                                     0x0
#define _TMR2_TMR2_POSITION                                 0x0
#define _TMR2_TMR2_SIZE                                     0x8
#define _TMR2_TMR2_LENGTH                                   0x8
#define _TMR2_TMR2_MASK                                     0xFF

// Register: T2PR
#define T2PR T2PR
extern volatile unsigned char           T2PR                __at(0x38D);
#ifndef _LIB_BUILD
asm("T2PR equ 038Dh");
#endif
// aliases
extern volatile unsigned char           PR2                 __at(0x38D);
#ifndef _LIB_BUILD
asm("PR2 equ 038Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T2PR                   :8;
    };
    struct {
        unsigned PR2                    :8;
    };
} T2PRbits_t;
extern volatile T2PRbits_t T2PRbits __at(0x38D);
// bitfield macros
#define _T2PR_T2PR_POSN                                     0x0
#define _T2PR_T2PR_POSITION                                 0x0
#define _T2PR_T2PR_SIZE                                     0x8
#define _T2PR_T2PR_LENGTH                                   0x8
#define _T2PR_T2PR_MASK                                     0xFF
#define _T2PR_PR2_POSN                                      0x0
#define _T2PR_PR2_POSITION                                  0x0
#define _T2PR_PR2_SIZE                                      0x8
#define _T2PR_PR2_LENGTH                                    0x8
#define _T2PR_PR2_MASK                                      0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned T2PR                   :8;
    };
    struct {
        unsigned PR2                    :8;
    };
} PR2bits_t;
extern volatile PR2bits_t PR2bits __at(0x38D);
// bitfield macros
#define _PR2_T2PR_POSN                                      0x0
#define _PR2_T2PR_POSITION                                  0x0
#define _PR2_T2PR_SIZE                                      0x8
#define _PR2_T2PR_LENGTH                                    0x8
#define _PR2_T2PR_MASK                                      0xFF
#define _PR2_PR2_POSN                                       0x0
#define _PR2_PR2_POSITION                                   0x0
#define _PR2_PR2_SIZE                                       0x8
#define _PR2_PR2_LENGTH                                     0x8
#define _PR2_PR2_MASK                                       0xFF

// Register: T2CON
#define T2CON T2CON
extern volatile unsigned char           T2CON               __at(0x38E);
#ifndef _LIB_BUILD
asm("T2CON equ 038Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned OUTPS                  :4;
        unsigned CKPS                   :3;
        unsigned ON                     :1;
    };
    struct {
        unsigned T2OUTPS                :4;
        unsigned T2CKPS                 :3;
        unsigned T2ON                   :1;
    };
    struct {
        unsigned T2OUTPS0               :1;
        unsigned T2OUTPS1               :1;
        unsigned T2OUTPS2               :1;
        unsigned T2OUTPS3               :1;
        unsigned T2CKPS0                :1;
        unsigned T2CKPS1                :1;
        unsigned T2CKPS2                :1;
    };
    struct {
        unsigned OUTPS0                 :1;
        unsigned OUTPS1                 :1;
        unsigned OUTPS2                 :1;
        unsigned OUTPS3                 :1;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
        unsigned CKPS2                  :1;
        unsigned TMR2ON                 :1;
    };
} T2CONbits_t;
