Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17154.h
extern volatile PWM2PRLbits_t PWM2PRLbits __at(0x50F);
// bitfield macros
#define _PWM2PRL_PRL_POSN                                   0x0
#define _PWM2PRL_PRL_POSITION                               0x0
#define _PWM2PRL_PRL_SIZE                                   0x8
#define _PWM2PRL_PRL_LENGTH                                 0x8
#define _PWM2PRL_PRL_MASK                                   0xFF

// Register: PWM2PRH
#define PWM2PRH PWM2PRH
extern volatile unsigned char           PWM2PRH             __at(0x510);
#ifndef _LIB_BUILD
asm("PWM2PRH equ 0510h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM2PRHbits_t;
extern volatile PWM2PRHbits_t PWM2PRHbits __at(0x510);
// bitfield macros
#define _PWM2PRH_PRH_POSN                                   0x0
#define _PWM2PRH_PRH_POSITION                               0x0
#define _PWM2PRH_PRH_SIZE                                   0x8
#define _PWM2PRH_PRH_LENGTH                                 0x8
#define _PWM2PRH_PRH_MASK                                   0xFF

// Register: PWM2CPRE
#define PWM2CPRE PWM2CPRE
extern volatile unsigned char           PWM2CPRE            __at(0x511);
#ifndef _LIB_BUILD
asm("PWM2CPRE equ 0511h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM2CPREbits_t;
extern volatile PWM2CPREbits_t PWM2CPREbits __at(0x511);
// bitfield macros
#define _PWM2CPRE_CPRE_POSN                                 0x0
#define _PWM2CPRE_CPRE_POSITION                             0x0
#define _PWM2CPRE_CPRE_SIZE                                 0x8
#define _PWM2CPRE_CPRE_LENGTH                               0x8
#define _PWM2CPRE_CPRE_MASK                                 0xFF

// Register: PWM2PIPOS
#define PWM2PIPOS PWM2PIPOS
extern volatile unsigned char           PWM2PIPOS           __at(0x512);
#ifndef _LIB_BUILD
asm("PWM2PIPOS equ 0512h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM2PIPOSbits_t;
extern volatile PWM2PIPOSbits_t PWM2PIPOSbits __at(0x512);
// bitfield macros
#define _PWM2PIPOS_PIPOS_POSN                               0x0
#define _PWM2PIPOS_PIPOS_POSITION                           0x0
#define _PWM2PIPOS_PIPOS_SIZE                               0x8
#define _PWM2PIPOS_PIPOS_LENGTH                             0x8
#define _PWM2PIPOS_PIPOS_MASK                               0xFF

// Register: PWM2GIR
#define PWM2GIR PWM2GIR
extern volatile unsigned char           PWM2GIR             __at(0x513);
#ifndef _LIB_BUILD
asm("PWM2GIR equ 0513h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM2GIRbits_t;
extern volatile PWM2GIRbits_t PWM2GIRbits __at(0x513);
// bitfield macros
#define _PWM2GIR_S1P1_POSN                                  0x0
#define _PWM2GIR_S1P1_POSITION                              0x0
#define _PWM2GIR_S1P1_SIZE                                  0x1
#define _PWM2GIR_S1P1_LENGTH                                0x1
#define _PWM2GIR_S1P1_MASK                                  0x1
#define _PWM2GIR_S1P2_POSN                                  0x1
#define _PWM2GIR_S1P2_POSITION                              0x1
#define _PWM2GIR_S1P2_SIZE                                  0x1
#define _PWM2GIR_S1P2_LENGTH                                0x1
#define _PWM2GIR_S1P2_MASK                                  0x2
#define _PWM2GIR_S1P1IF_POSN                                0x0
#define _PWM2GIR_S1P1IF_POSITION                            0x0
#define _PWM2GIR_S1P1IF_SIZE                                0x1
#define _PWM2GIR_S1P1IF_LENGTH                              0x1
#define _PWM2GIR_S1P1IF_MASK                                0x1
#define _PWM2GIR_S1P2IF_POSN                                0x1
#define _PWM2GIR_S1P2IF_POSITION                            0x1
#define _PWM2GIR_S1P2IF_SIZE                                0x1
#define _PWM2GIR_S1P2IF_LENGTH                              0x1
#define _PWM2GIR_S1P2IF_MASK                                0x2

// Register: PWM2GIE
#define PWM2GIE PWM2GIE
extern volatile unsigned char           PWM2GIE             __at(0x514);
#ifndef _LIB_BUILD
asm("PWM2GIE equ 0514h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM2GIEbits_t;
extern volatile PWM2GIEbits_t PWM2GIEbits __at(0x514);
// bitfield macros
#define _PWM2GIE_S1P1_POSN                                  0x0
#define _PWM2GIE_S1P1_POSITION                              0x0
#define _PWM2GIE_S1P1_SIZE                                  0x1
#define _PWM2GIE_S1P1_LENGTH                                0x1
#define _PWM2GIE_S1P1_MASK                                  0x1
#define _PWM2GIE_S1P2_POSN                                  0x1
#define _PWM2GIE_S1P2_POSITION                              0x1
#define _PWM2GIE_S1P2_SIZE                                  0x1
#define _PWM2GIE_S1P2_LENGTH                                0x1
#define _PWM2GIE_S1P2_MASK                                  0x2
#define _PWM2GIE_S1P1IE_POSN                                0x0
#define _PWM2GIE_S1P1IE_POSITION                            0x0
#define _PWM2GIE_S1P1IE_SIZE                                0x1
#define _PWM2GIE_S1P1IE_LENGTH                              0x1
#define _PWM2GIE_S1P1IE_MASK                                0x1
#define _PWM2GIE_S1P2IE_POSN                                0x1
#define _PWM2GIE_S1P2IE_POSITION                            0x1
#define _PWM2GIE_S1P2IE_SIZE                                0x1
#define _PWM2GIE_S1P2IE_LENGTH                              0x1
#define _PWM2GIE_S1P2IE_MASK                                0x2

