Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17154.h
extern volatile PWM3PRLbits_t PWM3PRLbits __at(0x98F);
// bitfield macros
#define _PWM3PRL_PRL_POSN                                   0x0
#define _PWM3PRL_PRL_POSITION                               0x0
#define _PWM3PRL_PRL_SIZE                                   0x8
#define _PWM3PRL_PRL_LENGTH                                 0x8
#define _PWM3PRL_PRL_MASK                                   0xFF

// Register: PWM3PRH
#define PWM3PRH PWM3PRH
extern volatile unsigned char           PWM3PRH             __at(0x990);
#ifndef _LIB_BUILD
asm("PWM3PRH equ 0990h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
} PWM3PRHbits_t;
extern volatile PWM3PRHbits_t PWM3PRHbits __at(0x990);
// bitfield macros
#define _PWM3PRH_PRH_POSN                                   0x0
#define _PWM3PRH_PRH_POSITION                               0x0
#define _PWM3PRH_PRH_SIZE                                   0x8
#define _PWM3PRH_PRH_LENGTH                                 0x8
#define _PWM3PRH_PRH_MASK                                   0xFF

// Register: PWM3CPRE
#define PWM3CPRE PWM3CPRE
extern volatile unsigned char           PWM3CPRE            __at(0x991);
#ifndef _LIB_BUILD
asm("PWM3CPRE equ 0991h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRE                   :8;
    };
} PWM3CPREbits_t;
extern volatile PWM3CPREbits_t PWM3CPREbits __at(0x991);
// bitfield macros
#define _PWM3CPRE_CPRE_POSN                                 0x0
#define _PWM3CPRE_CPRE_POSITION                             0x0
#define _PWM3CPRE_CPRE_SIZE                                 0x8
#define _PWM3CPRE_CPRE_LENGTH                               0x8
#define _PWM3CPRE_CPRE_MASK                                 0xFF

// Register: PWM3PIPOS
#define PWM3PIPOS PWM3PIPOS
extern volatile unsigned char           PWM3PIPOS           __at(0x992);
#ifndef _LIB_BUILD
asm("PWM3PIPOS equ 0992h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIPOS                  :8;
    };
} PWM3PIPOSbits_t;
extern volatile PWM3PIPOSbits_t PWM3PIPOSbits __at(0x992);
// bitfield macros
#define _PWM3PIPOS_PIPOS_POSN                               0x0
#define _PWM3PIPOS_PIPOS_POSITION                           0x0
#define _PWM3PIPOS_PIPOS_SIZE                               0x8
#define _PWM3PIPOS_PIPOS_LENGTH                             0x8
#define _PWM3PIPOS_PIPOS_MASK                               0xFF

// Register: PWM3GIR
#define PWM3GIR PWM3GIR
extern volatile unsigned char           PWM3GIR             __at(0x993);
#ifndef _LIB_BUILD
asm("PWM3GIR equ 0993h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IF                 :1;
        unsigned S1P2IF                 :1;
    };
} PWM3GIRbits_t;
extern volatile PWM3GIRbits_t PWM3GIRbits __at(0x993);
// bitfield macros
#define _PWM3GIR_S1P1_POSN                                  0x0
#define _PWM3GIR_S1P1_POSITION                              0x0
#define _PWM3GIR_S1P1_SIZE                                  0x1
#define _PWM3GIR_S1P1_LENGTH                                0x1
#define _PWM3GIR_S1P1_MASK                                  0x1
#define _PWM3GIR_S1P2_POSN                                  0x1
#define _PWM3GIR_S1P2_POSITION                              0x1
#define _PWM3GIR_S1P2_SIZE                                  0x1
#define _PWM3GIR_S1P2_LENGTH                                0x1
#define _PWM3GIR_S1P2_MASK                                  0x2
#define _PWM3GIR_S1P1IF_POSN                                0x0
#define _PWM3GIR_S1P1IF_POSITION                            0x0
#define _PWM3GIR_S1P1IF_SIZE                                0x1
#define _PWM3GIR_S1P1IF_LENGTH                              0x1
#define _PWM3GIR_S1P1IF_MASK                                0x1
#define _PWM3GIR_S1P2IF_POSN                                0x1
#define _PWM3GIR_S1P2IF_POSITION                            0x1
#define _PWM3GIR_S1P2IF_SIZE                                0x1
#define _PWM3GIR_S1P2IF_LENGTH                              0x1
#define _PWM3GIR_S1P2IF_MASK                                0x2

// Register: PWM3GIE
#define PWM3GIE PWM3GIE
extern volatile unsigned char           PWM3GIE             __at(0x994);
#ifndef _LIB_BUILD
asm("PWM3GIE equ 0994h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S1P1                   :1;
        unsigned S1P2                   :1;
    };
    struct {
        unsigned S1P1IE                 :1;
        unsigned S1P2IE                 :1;
    };
} PWM3GIEbits_t;
extern volatile PWM3GIEbits_t PWM3GIEbits __at(0x994);
// bitfield macros
#define _PWM3GIE_S1P1_POSN                                  0x0
#define _PWM3GIE_S1P1_POSITION                              0x0
#define _PWM3GIE_S1P1_SIZE                                  0x1
#define _PWM3GIE_S1P1_LENGTH                                0x1
#define _PWM3GIE_S1P1_MASK                                  0x1
#define _PWM3GIE_S1P2_POSN                                  0x1
#define _PWM3GIE_S1P2_POSITION                              0x1
#define _PWM3GIE_S1P2_SIZE                                  0x1
#define _PWM3GIE_S1P2_LENGTH                                0x1
#define _PWM3GIE_S1P2_MASK                                  0x2
#define _PWM3GIE_S1P1IE_POSN                                0x0
#define _PWM3GIE_S1P1IE_POSITION                            0x0
#define _PWM3GIE_S1P1IE_SIZE                                0x1
#define _PWM3GIE_S1P1IE_LENGTH                              0x1
#define _PWM3GIE_S1P1IE_MASK                                0x1
#define _PWM3GIE_S1P2IE_POSN                                0x1
#define _PWM3GIE_S1P2IE_POSITION                            0x1
#define _PWM3GIE_S1P2IE_SIZE                                0x1
#define _PWM3GIE_S1P2IE_LENGTH                              0x1
#define _PWM3GIE_S1P2IE_MASK                                0x2

// Register: PWM3CON
#define PWM3CON PWM3CON
extern volatile unsigned char           PWM3CON             __at(0x995);
#ifndef _LIB_BUILD
asm("PWM3CON equ 0995h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERSNOW                 :1;
        unsigned ERSPOL                 :1;
        unsigned LD                     :1;
        unsigned                        :4;
        unsigned EN                     :1;
    };
} PWM3CONbits_t;
extern volatile PWM3CONbits_t PWM3CONbits __at(0x995);
// bitfield macros
#define _PWM3CON_ERSNOW_POSN                                0x0
#define _PWM3CON_ERSNOW_POSITION                            0x0
#define _PWM3CON_ERSNOW_SIZE                                0x1
#define _PWM3CON_ERSNOW_LENGTH                              0x1
#define _PWM3CON_ERSNOW_MASK                                0x1
#define _PWM3CON_ERSPOL_POSN                                0x1
#define _PWM3CON_ERSPOL_POSITION                            0x1
#define _PWM3CON_ERSPOL_SIZE                                0x1
#define _PWM3CON_ERSPOL_LENGTH                              0x1
#define _PWM3CON_ERSPOL_MASK                                0x2
#define _PWM3CON_LD_POSN                                    0x2
#define _PWM3CON_LD_POSITION                                0x2
#define _PWM3CON_LD_SIZE                                    0x1
#define _PWM3CON_LD_LENGTH                                  0x1
#define _PWM3CON_LD_MASK                                    0x4
#define _PWM3CON_EN_POSN                                    0x7
#define _PWM3CON_EN_POSITION                                0x7
#define _PWM3CON_EN_SIZE                                    0x1
#define _PWM3CON_EN_LENGTH                                  0x1
#define _PWM3CON_EN_MASK                                    0x80

// Register: PWM3S1CFG
#define PWM3S1CFG PWM3S1CFG
extern volatile unsigned char           PWM3S1CFG           __at(0x996);
#ifndef _LIB_BUILD
asm("PWM3S1CFG equ 0996h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MODE                   :3;
        unsigned PPEN                   :1;
        unsigned                        :2;
        unsigned POL1                   :1;
        unsigned POL2                   :1;
    };
    struct {
        unsigned MODE0                  :1;
        unsigned MODE1                  :1;
        unsigned MODE2                  :1;
    };
} PWM3S1CFGbits_t;
extern volatile PWM3S1CFGbits_t PWM3S1CFGbits __at(0x996);
// bitfield macros
#define _PWM3S1CFG_MODE_POSN                                0x0
#define _PWM3S1CFG_MODE_POSITION                            0x0
#define _PWM3S1CFG_MODE_SIZE                                0x3
#define _PWM3S1CFG_MODE_LENGTH                              0x3
#define _PWM3S1CFG_MODE_MASK                                0x7
#define _PWM3S1CFG_PPEN_POSN                                0x3
#define _PWM3S1CFG_PPEN_POSITION                            0x3
#define _PWM3S1CFG_PPEN_SIZE                                0x1
#define _PWM3S1CFG_PPEN_LENGTH                              0x1
#define _PWM3S1CFG_PPEN_MASK                                0x8
#define _PWM3S1CFG_POL1_POSN                                0x6
#define _PWM3S1CFG_POL1_POSITION                            0x6
#define _PWM3S1CFG_POL1_SIZE                                0x1
#define _PWM3S1CFG_POL1_LENGTH                              0x1
#define _PWM3S1CFG_POL1_MASK                                0x40
#define _PWM3S1CFG_POL2_POSN                                0x7
#define _PWM3S1CFG_POL2_POSITION                            0x7
#define _PWM3S1CFG_POL2_SIZE                                0x1
#define _PWM3S1CFG_POL2_LENGTH                              0x1
#define _PWM3S1CFG_POL2_MASK                                0x80
#define _PWM3S1CFG_MODE0_POSN                               0x0
#define _PWM3S1CFG_MODE0_POSITION                           0x0
#define _PWM3S1CFG_MODE0_SIZE                               0x1
#define _PWM3S1CFG_MODE0_LENGTH                             0x1
#define _PWM3S1CFG_MODE0_MASK                               0x1
#define _PWM3S1CFG_MODE1_POSN                               0x1
#define _PWM3S1CFG_MODE1_POSITION                           0x1
#define _PWM3S1CFG_MODE1_SIZE                               0x1
#define _PWM3S1CFG_MODE1_LENGTH                             0x1
#define _PWM3S1CFG_MODE1_MASK                               0x2
#define _PWM3S1CFG_MODE2_POSN                               0x2
#define _PWM3S1CFG_MODE2_POSITION                           0x2
#define _PWM3S1CFG_MODE2_SIZE                               0x1
#define _PWM3S1CFG_MODE2_LENGTH                             0x1
#define _PWM3S1CFG_MODE2_MASK                               0x4

// Register: PWM3S1P1
#define PWM3S1P1 PWM3S1P1
extern volatile unsigned short          PWM3S1P1            __at(0x997);
#ifndef _LIB_BUILD
asm("PWM3S1P1 equ 0997h");
#endif

// Register: PWM3S1P1L
#define PWM3S1P1L PWM3S1P1L
extern volatile unsigned char           PWM3S1P1L           __at(0x997);
#ifndef _LIB_BUILD
asm("PWM3S1P1L equ 0997h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
    struct {
        unsigned S1P1L                  :8;
    };
} PWM3S1P1Lbits_t;
extern volatile PWM3S1P1Lbits_t PWM3S1P1Lbits __at(0x997);
// bitfield macros
#define _PWM3S1P1L_P1L_POSN                                 0x0
#define _PWM3S1P1L_P1L_POSITION                             0x0
#define _PWM3S1P1L_P1L_SIZE                                 0x8
#define _PWM3S1P1L_P1L_LENGTH                               0x8
#define _PWM3S1P1L_P1L_MASK                                 0xFF
#define _PWM3S1P1L_S1P1L_POSN                               0x0
#define _PWM3S1P1L_S1P1L_POSITION                           0x0
#define _PWM3S1P1L_S1P1L_SIZE                               0x8
#define _PWM3S1P1L_S1P1L_LENGTH                             0x8
#define _PWM3S1P1L_S1P1L_MASK                               0xFF

// Register: PWM3S1P1H
#define PWM3S1P1H PWM3S1P1H
extern volatile unsigned char           PWM3S1P1H           __at(0x998);
#ifndef _LIB_BUILD
asm("PWM3S1P1H equ 0998h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1H                    :8;
    };
    struct {
        unsigned S1P1H                  :8;
    };
} PWM3S1P1Hbits_t;
extern volatile PWM3S1P1Hbits_t PWM3S1P1Hbits __at(0x998);
// bitfield macros
#define _PWM3S1P1H_P1H_POSN                                 0x0
#define _PWM3S1P1H_P1H_POSITION                             0x0
#define _PWM3S1P1H_P1H_SIZE                                 0x8
#define _PWM3S1P1H_P1H_LENGTH                               0x8
#define _PWM3S1P1H_P1H_MASK                                 0xFF
#define _PWM3S1P1H_S1P1H_POSN                               0x0
#define _PWM3S1P1H_S1P1H_POSITION                           0x0
#define _PWM3S1P1H_S1P1H_SIZE                               0x8
#define _PWM3S1P1H_S1P1H_LENGTH                             0x8
#define _PWM3S1P1H_S1P1H_MASK                               0xFF

