Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f17154.h
// Register: UMTOAP
#define UMTOAP UMTOAP
extern volatile unsigned char           UMTOAP              __at(0x1F0C);
#ifndef _LIB_BUILD
asm("UMTOAP equ 01F0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAP                 :8;
    };
} UMTOAPbits_t;
extern volatile UMTOAPbits_t UMTOAPbits __at(0x1F0C);
// bitfield macros
#define _UMTOAP_UMTOAP_POSN                                 0x0
#define _UMTOAP_UMTOAP_POSITION                             0x0
#define _UMTOAP_UMTOAP_SIZE                                 0x8
#define _UMTOAP_UMTOAP_LENGTH                               0x8
#define _UMTOAP_UMTOAP_MASK                                 0xFF

// Register: UMTOAL
#define UMTOAL UMTOAL
extern volatile unsigned char           UMTOAL              __at(0x1F0D);
#ifndef _LIB_BUILD
asm("UMTOAL equ 01F0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAL                 :8;
    };
} UMTOALbits_t;
extern volatile UMTOALbits_t UMTOALbits __at(0x1F0D);
// bitfield macros
#define _UMTOAL_UMTOAL_POSN                                 0x0
#define _UMTOAL_UMTOAL_POSITION                             0x0
#define _UMTOAL_UMTOAL_SIZE                                 0x8
#define _UMTOAL_UMTOAL_LENGTH                               0x8
#define _UMTOAL_UMTOAL_MASK                                 0xFF

// Register: UMTOAH
#define UMTOAH UMTOAH
extern volatile unsigned char           UMTOAH              __at(0x1F0E);
#ifndef _LIB_BUILD
asm("UMTOAH equ 01F0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned UMTOAH                 :8;
    };
} UMTOAHbits_t;
extern volatile UMTOAHbits_t UMTOAHbits __at(0x1F0E);
// bitfield macros
#define _UMTOAH_UMTOAH_POSN                                 0x0
#define _UMTOAH_UMTOAH_POSITION                             0x0
#define _UMTOAH_UMTOAH_SIZE                                 0x8
#define _UMTOAH_UMTOAH_LENGTH                               0x8
#define _UMTOAH_UMTOAH_MASK                                 0xFF

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
extern volatile unsigned char           STATUS_SHAD         __at(0x1FE4);
#ifndef _LIB_BUILD
asm("STATUS_SHAD equ 01FE4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned STATUS_SHAD            :3;
    };
    struct {
        unsigned STATUS_SHAD0           :1;
        unsigned STATUS_SHAD1           :1;
        unsigned STATUS_SHAD2           :1;
    };
} STATUS_SHADbits_t;
extern volatile STATUS_SHADbits_t STATUS_SHADbits __at(0x1FE4);
// bitfield macros
#define _STATUS_SHAD_STATUS_SHAD_POSN                       0x0
#define _STATUS_SHAD_STATUS_SHAD_POSITION                   0x0
#define _STATUS_SHAD_STATUS_SHAD_SIZE                       0x3
#define _STATUS_SHAD_STATUS_SHAD_LENGTH                     0x3
#define _STATUS_SHAD_STATUS_SHAD_MASK                       0x7
#define _STATUS_SHAD_STATUS_SHAD0_POSN                      0x0
#define _STATUS_SHAD_STATUS_SHAD0_POSITION                  0x0
#define _STATUS_SHAD_STATUS_SHAD0_SIZE                      0x1
#define _STATUS_SHAD_STATUS_SHAD0_LENGTH                    0x1
#define _STATUS_SHAD_STATUS_SHAD0_MASK                      0x1
#define _STATUS_SHAD_STATUS_SHAD1_POSN                      0x1
#define _STATUS_SHAD_STATUS_SHAD1_POSITION                  0x1
#define _STATUS_SHAD_STATUS_SHAD1_SIZE                      0x1
#define _STATUS_SHAD_STATUS_SHAD1_LENGTH                    0x1
#define _STATUS_SHAD_STATUS_SHAD1_MASK                      0x2
#define _STATUS_SHAD_STATUS_SHAD2_POSN                      0x2
#define _STATUS_SHAD_STATUS_SHAD2_POSITION                  0x2
#define _STATUS_SHAD_STATUS_SHAD2_SIZE                      0x1
#define _STATUS_SHAD_STATUS_SHAD2_LENGTH                    0x1
#define _STATUS_SHAD_STATUS_SHAD2_MASK                      0x4

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
extern volatile unsigned char           WREG_SHAD           __at(0x1FE5);
#ifndef _LIB_BUILD
asm("WREG_SHAD equ 01FE5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WREG_SHAD              :8;
    };
} WREG_SHADbits_t;
extern volatile WREG_SHADbits_t WREG_SHADbits __at(0x1FE5);
// bitfield macros
#define _WREG_SHAD_WREG_SHAD_POSN                           0x0
#define _WREG_SHAD_WREG_SHAD_POSITION                       0x0
#define _WREG_SHAD_WREG_SHAD_SIZE                           0x8
#define _WREG_SHAD_WREG_SHAD_LENGTH                         0x8
#define _WREG_SHAD_WREG_SHAD_MASK                           0xFF

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
extern volatile unsigned char           BSR_SHAD            __at(0x1FE6);
#ifndef _LIB_BUILD
asm("BSR_SHAD equ 01FE6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned BSR_SHAD               :8;
    };
} BSR_SHADbits_t;
extern volatile BSR_SHADbits_t BSR_SHADbits __at(0x1FE6);
// bitfield macros
#define _BSR_SHAD_BSR_SHAD_POSN                             0x0
#define _BSR_SHAD_BSR_SHAD_POSITION                         0x0
#define _BSR_SHAD_BSR_SHAD_SIZE                             0x8
#define _BSR_SHAD_BSR_SHAD_LENGTH                           0x8
#define _BSR_SHAD_BSR_SHAD_MASK                             0xFF

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
extern volatile unsigned char           PCLATH_SHAD         __at(0x1FE7);
#ifndef _LIB_BUILD
asm("PCLATH_SHAD equ 01FE7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PCLATH_SHAD            :8;
    };
} PCLATH_SHADbits_t;
extern volatile PCLATH_SHADbits_t PCLATH_SHADbits __at(0x1FE7);
// bitfield macros
#define _PCLATH_SHAD_PCLATH_SHAD_POSN                       0x0
#define _PCLATH_SHAD_PCLATH_SHAD_POSITION                   0x0
#define _PCLATH_SHAD_PCLATH_SHAD_SIZE                       0x8
#define _PCLATH_SHAD_PCLATH_SHAD_LENGTH                     0x8
#define _PCLATH_SHAD_PCLATH_SHAD_MASK                       0xFF

// Register: FSR0_SHAD
#define FSR0_SHAD FSR0_SHAD
extern volatile unsigned short          FSR0_SHAD           __at(0x1FE8);
#ifndef _LIB_BUILD
asm("FSR0_SHAD equ 01FE8h");
#endif

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
extern volatile unsigned char           FSR0L_SHAD          __at(0x1FE8);
#ifndef _LIB_BUILD
asm("FSR0L_SHAD equ 01FE8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0L_SHAD             :8;
    };
} FSR0L_SHADbits_t;
extern volatile FSR0L_SHADbits_t FSR0L_SHADbits __at(0x1FE8);
// bitfield macros
#define _FSR0L_SHAD_FSR0L_SHAD_POSN                         0x0
#define _FSR0L_SHAD_FSR0L_SHAD_POSITION                     0x0
#define _FSR0L_SHAD_FSR0L_SHAD_SIZE                         0x8
#define _FSR0L_SHAD_FSR0L_SHAD_LENGTH                       0x8
#define _FSR0L_SHAD_FSR0L_SHAD_MASK                         0xFF

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
extern volatile unsigned char           FSR0H_SHAD          __at(0x1FE9);
#ifndef _LIB_BUILD
asm("FSR0H_SHAD equ 01FE9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR0H_SHAD             :8;
    };
} FSR0H_SHADbits_t;
extern volatile FSR0H_SHADbits_t FSR0H_SHADbits __at(0x1FE9);
// bitfield macros
#define _FSR0H_SHAD_FSR0H_SHAD_POSN                         0x0
#define _FSR0H_SHAD_FSR0H_SHAD_POSITION                     0x0
#define _FSR0H_SHAD_FSR0H_SHAD_SIZE                         0x8
#define _FSR0H_SHAD_FSR0H_SHAD_LENGTH                       0x8
#define _FSR0H_SHAD_FSR0H_SHAD_MASK                         0xFF

// Register: FSR1_SHAD
#define FSR1_SHAD FSR1_SHAD
extern volatile unsigned short          FSR1_SHAD           __at(0x1FEA);
#ifndef _LIB_BUILD
asm("FSR1_SHAD equ 01FEAh");
#endif

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
extern volatile unsigned char           FSR1L_SHAD          __at(0x1FEA);
#ifndef _LIB_BUILD
asm("FSR1L_SHAD equ 01FEAh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned FSR1L_SHAD             :8;
    };
} FSR1L_SHADbits_t;
